html/lc-126-word-ladder-ii.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>126. Word Ladder II</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">126. Word Ladder II</h1>
<p>
<a href="https://leetcode.com/problems/word-ladder-ii/">https://leetcode.com/problems/word-ladder-ii/</a>
</p>

<p>
我觉得这题很有意思，是里面涉及到了两个点： 如何判断两个字符串之间只相差一个字符，以及如何枚举所有的最短路径。
</p>

<hr  />

<p>
先说第一个问题，如何判断两个字符串之间只相差一个字符。比如 "hot"和"hit"就差一个字符，而"hot"和"hig"则相差两个字符。
假设所有字符串长度是K，共有N个字符串。
</p>

<p>
一种办法是枚举每个位置的所有字符，创建字典然后去查询。以上面例子说明：
</p>
<ul class="org-ul">
<li>在位置0, hot可以产生这些字符串 aot, bot, cot, &#x2026;zot
</li>
<li>在位置1上，hot可以产生 hat, hbt .. hzt
</li>
<li>可以看到在枚举位置1的时候，就会和 "hit" 字符串重合
</li>
</ul>

<p>
时间复杂度是O(26 * N * K^2), 空间复杂度是O(26 * N * K)
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(k):
    <span class="org-py-variable-name">subwords</span> = defaultdict(list)
    <span class="org-keyword">for</span> idx, w <span class="org-keyword">in</span> <span class="org-py-builtins">enumerate</span>(wordList):
        <span class="org-keyword">for</span> c <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(<span class="org-py-number">26</span>):
            <span class="org-py-variable-name">x</span> = <span class="org-py-builtins">chr</span>(ord(<span class="org-string">'a'</span>) + c)
            <span class="org-keyword">if</span> <span class="org-py-variable-name">x</span> == w[i]:
                <span class="org-keyword">continue</span>
            <span class="org-py-variable-name">s</span> = w[:i] + x + w[i + <span class="org-py-number">1</span>:]
            subwords[s].append(idx)
    <span class="org-keyword">for</span> idx, w <span class="org-keyword">in</span> <span class="org-py-builtins">enumerate</span>(wordList):
        <span class="org-py-variable-name">xs</span> = subwords[w]
        <span class="org-keyword">for</span> x <span class="org-keyword">in</span> xs:
            adj[idx].append(x)
</pre>
</div>

<p>
这里还有另外一个办法，同样我们还是枚举所有的位置
</p>
<ul class="org-ul">
<li>但那是在这些位置上不是枚举字符，而是直接删除
</li>
<li>在位置0上, hot-&gt;ot, hit-&gt;it, hig-&gt;ig
</li>
<li>在位置1上, hot-&gt;ht, hit-&gt;ht, hig-&gt;hg
</li>
<li>可以看到在位置1上出现了重合
</li>
</ul>

<p>
这样做时间复杂度是O(N * K^2). 空间复杂度是O(N * K). 不要小看这个常数项，提交之后时间可以从1400ms缩减到200ms.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(k):
    <span class="org-py-variable-name">wl</span> = [(x[:i] + x[i + <span class="org-py-number">1</span>:], idx) <span class="org-keyword">for</span> (idx, x) <span class="org-keyword">in</span> <span class="org-py-builtins">enumerate</span>(wordlist)]
    <span class="org-py-import-from">from</span> collections <span class="org-py-import-from">import</span> defaultdict
    <span class="org-py-variable-name">groups</span> = defaultdict(list)
    <span class="org-keyword">for</span> w, idx <span class="org-keyword">in</span> wl:
        groups[w].append(idx)
    <span class="org-keyword">for</span> w, xs <span class="org-keyword">in</span> groups.items():
        <span class="org-keyword">for</span> j <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(len(xs)):
            <span class="org-keyword">for</span> k <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(j + <span class="org-py-number">1</span>, <span class="org-py-builtins">len</span>(xs)):
                <span class="org-py-variable-name">x</span>, <span class="org-py-variable-name">y</span> = xs[j], xs[k]
                G[x].append(y)
                G[y].append(x)
</pre>
</div>

<hr  />

<p>
第二个问题就是如何枚举所有最短的路径。经典的最短路径比如BFS或者是Dijkstra算法，只给出其中一条最短路径。但是这些算法基础上稍微扩展一些，其实就可以得到所有最短路径。
</p>

<p>
以BFS最短路径为例（如果扩展到dijkstra应该也是适用的）
</p>
<ul class="org-ul">
<li>如果从u-&gt;v点，到达v点的长度是d
</li>
<li>还存在u'-&gt;v点，到达v点的长度也是d
</li>
<li>但是如果u2-&gt;v点，到达v点的长度&gt;=d的话，那么可以舍弃
</li>
<li>记录方式可以有两种，按照前向和候向记录
<ul class="org-ul">
<li>前向是 forward[u].append(v)
</li>
<li>后向是 backward[v].append(u)
</li>
</ul>
</li>
</ul>

<p>
将这些前向/后向集合记录下来之后，就可以使用dfs的办法来获取所有的最短路径了。
</p>

<p>
在代码实现上，我们还是使用BFS算法。
</p>
<ul class="org-ul">
<li>depth[v]表示到达v这个节点的最短路径长度是多少
</li>
<li>fwd_links 和 back_links 分别表示前向后向（其实只需要保存一个就行）
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span class="org-py-import-from">from</span> collections <span class="org-py-import-from">import</span> deque
<span class="org-py-variable-name">dq</span> = deque()
<span class="org-py-variable-name">depth</span> = [<span class="org-py-number">0</span>] * n
<span class="org-py-variable-name">depth</span>[begin] = <span class="org-py-number">1</span>
dq.append(begin)

<span class="org-py-variable-name">fwd_links</span> = [[] <span class="org-keyword">for</span> <span class="org-py-builtins">_</span> <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(n)]
<span class="org-py-variable-name">back_links</span> = [[] <span class="org-keyword">for</span> <span class="org-py-builtins">_</span> <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(n)]
<span class="org-keyword">while</span> dq:
    <span class="org-py-variable-name">s</span> = dq.popleft()
    <span class="org-keyword">if</span> <span class="org-py-variable-name">s</span> == end:
        <span class="org-keyword">break</span>

    <span class="org-keyword">for</span> t <span class="org-keyword">in</span> adj[s]:
        <span class="org-keyword">if</span> <span class="org-py-variable-name">depth</span>[t] == <span class="org-py-number">0</span>:
            <span class="org-py-variable-name">depth</span>[t] = depth[s] + <span class="org-py-number">1</span>
            dq.append(t)

        <span class="org-keyword">if</span> <span class="org-py-variable-name">depth</span>[t] == (depth[s] + <span class="org-py-number">1</span>):
            fwd_links[s].append(t)
            back_links[t].append(s)
</pre>
</div>

<p>
至于dfs得到所有最短路径，可以使用迭代也可以使用递归。我这里给出前向迭代和后向递归的代码。
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">==============================</span>
        <span class="org-keyword">if</span> fwd_iter:
            <span class="org-py-variable-name">ans</span> = [[begin]]
            <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(<span class="org-py-number">1</span>, depth[end]):
                <span class="org-py-variable-name">tmp</span> = []
                <span class="org-keyword">for</span> path <span class="org-keyword">in</span> ans:
                    <span class="org-py-variable-name">e</span> = path[-<span class="org-py-number">1</span>]
                    <span class="org-py-variable-name">d</span> = <span class="org-py-builtins">len</span>(path) + <span class="org-py-number">1</span>
                    <span class="org-keyword">for</span> v <span class="org-keyword">in</span> fwd_links[e]:
                        <span class="org-keyword">assert</span> <span class="org-py-variable-name">depth</span>[v] == d
                        tmp.append(path + [v])
                <span class="org-py-variable-name">ans</span> = tmp

            <span class="org-py-variable-name">ans</span> = [[wordList[i] <span class="org-keyword">for</span> i <span class="org-keyword">in</span> path] <span class="org-keyword">for</span> path <span class="org-keyword">in</span> ans <span class="org-keyword">if</span> <span class="org-py-variable-name">path</span>[-<span class="org-py-number">1</span>] == end]
            <span class="org-keyword">return</span> ans

<span class="org-comment-delimiter"># </span><span class="org-comment">====================</span>
        <span class="org-keyword">if</span> back_rec:
            <span class="org-py-variable-name">ans</span> = []

            <span class="org-py-def-class">def</span> <span class="org-function-name">dfs</span>(v, path, d):
                <span class="org-keyword">if</span> depth[v] &gt; d:
                    <span class="org-keyword">return</span>

                <span class="org-keyword">if</span> <span class="org-py-variable-name">v</span> == begin:
                    ans.append([wordList[i] <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">reversed</span>(path)])
                    <span class="org-keyword">return</span>

                <span class="org-keyword">for</span> t <span class="org-keyword">in</span> back_links[v]:
                    path.append(t)
                    dfs(t, path, d - <span class="org-py-number">1</span>)
                    path.pop()

            dfs(end, [end], depth[end])
            <span class="org-keyword">return</span> ans
</pre>
</div>
</div>
</body>
</html>
